---
kind: property
id: P:Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs.LinkedResourcePathName
source: html/0d0a04b8-1ac8-48b9-475c-43f67fddf3bd.htm
---
# Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs.LinkedResourcePathName Property

Path of the linked resource.

## Syntax (C#)
```csharp
public string LinkedResourcePathName { get; }
```